from os import getenv #импортируем токен с доступом к боту
import asyncio #импортируем асинхронные функции
from aiogram import Bot, Dispatcher, Router
from dotenv import load_dotenv
from aiogram.filters import Command
from aiogram.types import Message
import random 
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton  # для создания кнопок
from aiogram.types import CallbackQuery
from aiogram.types import FSInputFile
import os
TARO_CARDS = {
    "Шут": "Сегодня ты проснешься с мыслью 'А почему бы и нет?' и это приведет к приключениям. Доверься вселенной, даже если она сегодня в плохом настроении.",
    
    "Маг": "Ты сегодня можешь всё! Даже заварить чай, не облившись кипятком. Твои таланты на пике, используй их во благо (или хотя бы не во вред).",
    
    "Верховная Жрица": "Интуиция сегодня твой главный советчик. Прислушайся к внутреннему голосу, даже если он кажется тихим. Ответы уже есть внутри тебя.",
    
    "Императрица": "День плодородия: вырасти могут не только цветы на подоконнике, но и твои идеи. Заботься о себе, как о редком кактусе.",
    
    "Император": "Сегодня ты главный. Наведи порядок в делах и потребуй уважения к своим личным границам. Власть — это ответственность (и иногда печенька).",
    
    "Иерофант": "Ищи мудрость в неожиданных местах: в комментариях, в мемах или в разговоре с бабушкой у подъезда.",
    
    "Влюбленные": "Судьба дает тебе выбор: кофе или чай? Сидеть на работе или 'еще 5 минуточек'? Выбирай сердцем (или рандомайзером).",
    
    "Колесница": "Держи курс! Сегодня ты можешь свернуть горы, особенно если это гора дел. Главное — не потеряй колесо по пути.",
    
    "Сила": "У тебя есть сила починить текущий кран и смелость признаться, что ты сломал его вчера. Будь сильным, но добрым.",
    
    "Отшельник": "Лучший план на сегодня — остаться дома с книжкой. Социальная батарейка разряжена, пора на подзарядку.",
    
    "Колесо Фортуны": "Сегодня повезет! Возможно, найдешь 10 рублей под диваном. Удача любит наглых, но сегодня она любит всех.",
    
    "Справедливость": "Вселенная сегодня — строгий учитель. Что посеешь, то и пожнешь. Посей что-нибудь хорошее.",
    
    "Повешенный": "Если всё валится из рук — расслабься и посмотри на мир с другой стороны. Может, это не руки кривые, а мир перевернулся?",
    
    "Смерть": "Не пугайся! Сегодня просто пора расстаться со старым: выбросить сломанный зонт, удалить номер бывшего, доесть вчерашний суп.",
    
    "Умеренность": "Золотая середина — вот твой девиз. Не переедай, но и не голодай. Не работай до упаду, но и не ленись. Балансируй.",
    
    "Дьявол": "Осторожно, соблазны! Торт с витрины смотрит на тебя. Карта советует: поддайся, но знай меру.",
    
    "Башня": "Жди перемен! Возможно, неожиданных. Может сломаться любимая чашка, но зато ты купишь новую, ещё лучше.",
    
    "Звезда": "Надейся на лучшее! Даже если сегодня пятница, 13-е, а ты потерял носок — завтра будет новый день и новый носок.",
    
    "Луна": "Сегодня всё не то, чем кажется. Доверяй, но проверяй. Особенно если обещают халяву.",
    
    "Солнце": "Ура! День будет офигенным! Улыбнись прохожему, и он подумает, что ты счастливый человек (или странный).",
    
    "Суд": "Тебя ждет важное осознание. Например, что ты давно не звонил маме. Или что суп в холодильнике испортился.",
    
    "Мир": "Гармония и покой. Сделай вдох-выдох. Сегодня всё будет хорошо. Ты молодец!"
}



def get_card_photo(card_name):
    folder = "images"
    
    file_path = os.path.join(folder, f"{card_name}.jpg")
    
    if os.path.exists(file_path):
        return FSInputFile(file_path)
    else:
        
        print(f"Фото не найдено для карты: {card_name}")
        return None


def get_card_photo(card_name):
    
    folder = "images"
    
    extensions = ['.jpg', '.jpeg', '.png', '.webp']
    
    for ext in extensions:
        file_path = os.path.join(folder, f"{card_name}{ext}")
        if os.path.exists(file_path):
            return FSInputFile(file_path)
    
    print(f"Фото не найдено для карты: {card_name}")
    return None


def get_keyboard():

    buttons = [
            [InlineKeyboardButton(text="🎴 Получить карту", callback_data="card")],
            [InlineKeyboardButton(text="❓ Помощь", callback_data="help"),
            InlineKeyboardButton(text="ℹ️ О боте", callback_data="about")]
        ]
        
        
    keyboard = InlineKeyboardMarkup(inline_keyboard=buttons)
    return keyboard






load_dotenv()#чтобы данные подгружались корректно
TOKEN=getenv("BOT_TOKEN")


dp=Dispatcher()#принимает все входящие сообщения


router=Router()#определяет и обрабатывает входящие сообщения пользователя
dp.include_router(router)



@router.message(Command("start"))#Обращаемся к нашему роутеру (тому самому router = Router()) Ловим сообщения (не колбэки от кнопок, не инлайн-запросы)
async def start_command(message: Message):#Функция, которая выполнится, когда сообщение подойдёт
    kb=get_keyboard()    
    await message.answer("Здраствуйте, вы попали в бот Просто таро! Вытяните одну из двадцати двух карт и получите предсказание на день", 
        reply_markup=kb
)


@router.message(Command("help"))
async def help_command(message: Message):
    
    await message.answer("Команды: \n/start - запустить бот\n/help - список команд\n/about - о нас")
    


@router.message(Command("about"))
async def about_command(message:Message):
    await message.answer("Бот, который предсказывает будущее в мемах. Без воды, без эзотерики, только боль и веселье. В колоде 22 карты (и будет пополняться!), каждая описывает типичную ситуацию из жизни.")





@router.message(Command("card")) 
async def card_command(message: Message): 
    vse_karti = list(TARO_CARDS.items())  
    sluchaynaya_karta = random.choice(vse_karti)  
    nazvanie_karty = sluchaynaya_karta[0] 
    predskazanie = sluchaynaya_karta[1]   
    otvet = f"Твоя карта: {nazvanie_karty}\n\n{predskazanie}"
    photo = get_card_photo(nazvanie_karty)
    
    if photo:
        
        await message.answer_photo(
            photo=photo,
            caption=otvet
        )
    else:
        
        await message.answer(otvet)
     
    



@router.callback_query()  # ловим все нажатия на inline-кнопки
async def handle_callback(callback: CallbackQuery): #Обрабатывает нажатия на inline-кнопки
    
    # Получаем данные из кнопки (то, что в callback_data)
    action = callback.data
    
    # Отвечаем на нажатие (убираем "часики" на кнопке)
    await callback.answer()
    
    # В зависимости от того, какая кнопка нажата, делаем разные действия
    if action == "card":
        vse_karti = list(TARO_CARDS.items())  
        sluchaynaya_karta = random.choice(vse_karti)  
        nazvanie_karty = sluchaynaya_karta[0] 
        predskazanie = sluchaynaya_karta[1]   
        otvet = f"Твоя карта: {nazvanie_karty}\n\n{predskazanie}"
        photo = get_card_photo(nazvanie_karty)
        
        if photo:
            await callback.message.answer_photo(
                photo=photo,
                caption=otvet
            )
        else:
            await callback.message.answer(otvet)
        
    elif action == "help":
        await callback.message.answer("Команды: \n/start - запустить бот\n/help - список команд\n/about - о нас")
        
        
    elif action == "about":
        await callback.message.answer("Бот, который предсказывает будущее в мемах. Без воды, без эзотерики, только боль и веселье. В колоде 22 карты (и будет пополняться!), каждая описывает типичную ситуацию из жизни.")


async def main():
    bot=Bot(token=TOKEN)#прописываем с каким ботом взаимодействуем
    print("Start...")
    await dp.start_polling(bot)#ждём запуска бота




if __name__=="__main__":#если наш файл основной то мы обращаемся к асинхронной функции main
    asyncio.run(main()) #запуск проекта



    
